Tekla Open API Reference for Tekla Structures 2025
ProgressBar Methods
The Operation.ProgressBar type exposes the following members.
Methods
Name | Description
Canceled
 Check if cancel has been pressed.
Close
 Close progress bar. Can be called even if Display was not successful.
Display
 Display progress bar dialog with cancel button. Display will fail if progress bar is already displayed.
SetProgress
 Update status information on the progress bar.
Top
See Also
Reference
Operation.ProgressBar Class
Tekla.Structures.Model.Operations Namespace